; domain
(define (domain Perestroika)
(:requirements :typing :equality)
(:types location resource - object
        
)

(:predicates (at-agent ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (taken ?r - resource)
             (accessible ?l - location)
             (alive)
             (dead)
             (solid ?l - location)
             (big ?l - location)
             (medium ?l - location)
             (small ?l - location)
             (none ?l - location)   
             (act-round)

            ; (dup-accessible ?l - location)
)

(:action move
:parameters (?l1 ?l2 - location)
:precondition (and (at-agent ?l1)
                   (alive)
                   (connected ?l1 ?l2)
                   (accessible ?l2)
                  ; (dup-accessible ?l2)
              )
:effect (and (not (at-agent ?l1))
             (at-agent ?l2)
        )
)

(:action collect
:parameters (?r - resource ?l - location)
:precondition (and (at-agent ?l)
                   (at-res ?r ?l)
                   (alive)
              )
:effect (and (taken ?r)
        )
)


)

; problem
(define (problem Perestroika-problem)
(:domain Perestroika)
(:objects r1 r2 r3 r4 - resource
          l-1-1 l-1-2 l-1-3 l-1-4 l-1-5 l-1-6 l-1-7 l-1-8 l-1-9 l-2-1 l-2-2 l-2-3 l-2-4 l-2-5 l-2-6 l-2-7 l-2-8 l-2-9 l-3-1 l-3-2 l-3-3 l-3-4 l-3-5 l-3-6 l-3-7 l-3-8 l-3-9 l-4-1 l-4-2 l-4-3 l-4-4 l-4-5 l-4-6 l-4-7 l-4-8 l-4-9 l-5-1 l-5-2 l-5-3 l-5-4 l-5-5 l-5-6 l-5-7 l-5-8 l-5-9 l-6-1 l-6-2 l-6-3 l-6-4 l-6-5 l-6-6 l-6-7 l-6-8 l-6-9 l-7-1 l-7-2 l-7-3 l-7-4 l-7-5 l-7-6 l-7-7 l-7-8 l-7-9 l-8-1 l-8-2 l-8-3 l-8-4 l-8-5 l-8-6 l-8-7 l-8-8 l-8-9 l-9-1 l-9-2 l-9-3 l-9-4 l-9-5 l-9-6 l-9-7 l-9-8 l-9-9 - location
)

(:init (act-round)
       (alive)
       (at-agent l-1-1)
       (at-res r1 l-1-9)
       (at-res r2 l-5-5)
       (at-res r3 l-9-9)
       (at-res r4 l-9-1)

(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-1-3 l-1-4)
(connected l-1-4 l-1-3)
(connected l-1-4 l-2-4)
(connected l-2-4 l-1-4)
(connected l-1-4 l-1-5)
(connected l-1-5 l-1-4)
(connected l-1-5 l-2-5)
(connected l-2-5 l-1-5)
(connected l-1-5 l-1-6)
(connected l-1-6 l-1-5)
(connected l-1-6 l-2-6)
(connected l-2-6 l-1-6)
(connected l-1-6 l-1-7)
(connected l-1-7 l-1-6)
(connected l-1-7 l-2-7)
(connected l-2-7 l-1-7)
(connected l-1-7 l-1-8)
(connected l-1-8 l-1-7)
(connected l-1-8 l-2-8)
(connected l-2-8 l-1-8)
(connected l-1-8 l-1-9)
(connected l-1-9 l-1-8)
(connected l-1-9 l-2-9)
(connected l-2-9 l-1-9)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-2-3 l-2-4)
(connected l-2-4 l-2-3)
(connected l-2-4 l-3-4)
(connected l-3-4 l-2-4)
(connected l-2-4 l-2-5)
(connected l-2-5 l-2-4)
(connected l-2-5 l-3-5)
(connected l-3-5 l-2-5)
(connected l-2-5 l-2-6)
(connected l-2-6 l-2-5)
(connected l-2-6 l-3-6)
(connected l-3-6 l-2-6)
(connected l-2-6 l-2-7)
(connected l-2-7 l-2-6)
(connected l-2-7 l-3-7)
(connected l-3-7 l-2-7)
(connected l-2-7 l-2-8)
(connected l-2-8 l-2-7)
(connected l-2-8 l-3-8)
(connected l-3-8 l-2-8)
(connected l-2-8 l-2-9)
(connected l-2-9 l-2-8)
(connected l-2-9 l-3-9)
(connected l-3-9 l-2-9)
(connected l-3-1 l-4-1)
(connected l-4-1 l-3-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-4-2)
(connected l-4-2 l-3-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-3-3 l-4-3)
(connected l-4-3 l-3-3)
(connected l-3-3 l-3-4)
(connected l-3-4 l-3-3)
(connected l-3-4 l-4-4)
(connected l-4-4 l-3-4)
(connected l-3-4 l-3-5)
(connected l-3-5 l-3-4)
(connected l-3-5 l-4-5)
(connected l-4-5 l-3-5)
(connected l-3-5 l-3-6)
(connected l-3-6 l-3-5)
(connected l-3-6 l-4-6)
(connected l-4-6 l-3-6)
(connected l-3-6 l-3-7)
(connected l-3-7 l-3-6)
(connected l-3-7 l-4-7)
(connected l-4-7 l-3-7)
(connected l-3-7 l-3-8)
(connected l-3-8 l-3-7)
(connected l-3-8 l-4-8)
(connected l-4-8 l-3-8)
(connected l-3-8 l-3-9)
(connected l-3-9 l-3-8)
(connected l-3-9 l-4-9)
(connected l-4-9 l-3-9)
(connected l-4-1 l-5-1)
(connected l-5-1 l-4-1)
(connected l-4-1 l-4-2)
(connected l-4-2 l-4-1)
(connected l-4-2 l-5-2)
(connected l-5-2 l-4-2)
(connected l-4-2 l-4-3)
(connected l-4-3 l-4-2)
(connected l-4-3 l-5-3)
(connected l-5-3 l-4-3)
(connected l-4-3 l-4-4)
(connected l-4-4 l-4-3)
(connected l-4-4 l-5-4)
(connected l-5-4 l-4-4)
(connected l-4-4 l-4-5)
(connected l-4-5 l-4-4)
(connected l-4-5 l-5-5)
(connected l-5-5 l-4-5)
(connected l-4-5 l-4-6)
(connected l-4-6 l-4-5)
(connected l-4-6 l-5-6)
(connected l-5-6 l-4-6)
(connected l-4-6 l-4-7)
(connected l-4-7 l-4-6)
(connected l-4-7 l-5-7)
(connected l-5-7 l-4-7)
(connected l-4-7 l-4-8)
(connected l-4-8 l-4-7)
(connected l-4-8 l-5-8)
(connected l-5-8 l-4-8)
(connected l-4-8 l-4-9)
(connected l-4-9 l-4-8)
(connected l-4-9 l-5-9)
(connected l-5-9 l-4-9)
(connected l-5-1 l-6-1)
(connected l-6-1 l-5-1)
(connected l-5-1 l-5-2)
(connected l-5-2 l-5-1)
(connected l-5-2 l-6-2)
(connected l-6-2 l-5-2)
(connected l-5-2 l-5-3)
(connected l-5-3 l-5-2)
(connected l-5-3 l-6-3)
(connected l-6-3 l-5-3)
(connected l-5-3 l-5-4)
(connected l-5-4 l-5-3)
(connected l-5-4 l-6-4)
(connected l-6-4 l-5-4)
(connected l-5-4 l-5-5)
(connected l-5-5 l-5-4)
(connected l-5-5 l-6-5)
(connected l-6-5 l-5-5)
(connected l-5-5 l-5-6)
(connected l-5-6 l-5-5)
(connected l-5-6 l-6-6)
(connected l-6-6 l-5-6)
(connected l-5-6 l-5-7)
(connected l-5-7 l-5-6)
(connected l-5-7 l-6-7)
(connected l-6-7 l-5-7)
(connected l-5-7 l-5-8)
(connected l-5-8 l-5-7)
(connected l-5-8 l-6-8)
(connected l-6-8 l-5-8)
(connected l-5-8 l-5-9)
(connected l-5-9 l-5-8)
(connected l-5-9 l-6-9)
(connected l-6-9 l-5-9)
(connected l-6-1 l-7-1)
(connected l-7-1 l-6-1)
(connected l-6-1 l-6-2)
(connected l-6-2 l-6-1)
(connected l-6-2 l-7-2)
(connected l-7-2 l-6-2)
(connected l-6-2 l-6-3)
(connected l-6-3 l-6-2)
(connected l-6-3 l-7-3)
(connected l-7-3 l-6-3)
(connected l-6-3 l-6-4)
(connected l-6-4 l-6-3)
(connected l-6-4 l-7-4)
(connected l-7-4 l-6-4)
(connected l-6-4 l-6-5)
(connected l-6-5 l-6-4)
(connected l-6-5 l-7-5)
(connected l-7-5 l-6-5)
(connected l-6-5 l-6-6)
(connected l-6-6 l-6-5)
(connected l-6-6 l-7-6)
(connected l-7-6 l-6-6)
(connected l-6-6 l-6-7)
(connected l-6-7 l-6-6)
(connected l-6-7 l-7-7)
(connected l-7-7 l-6-7)
(connected l-6-7 l-6-8)
(connected l-6-8 l-6-7)
(connected l-6-8 l-7-8)
(connected l-7-8 l-6-8)
(connected l-6-8 l-6-9)
(connected l-6-9 l-6-8)
(connected l-6-9 l-7-9)
(connected l-7-9 l-6-9)
(connected l-7-1 l-8-1)
(connected l-8-1 l-7-1)
(connected l-7-1 l-7-2)
(connected l-7-2 l-7-1)
(connected l-7-2 l-8-2)
(connected l-8-2 l-7-2)
(connected l-7-2 l-7-3)
(connected l-7-3 l-7-2)
(connected l-7-3 l-8-3)
(connected l-8-3 l-7-3)
(connected l-7-3 l-7-4)
(connected l-7-4 l-7-3)
(connected l-7-4 l-8-4)
(connected l-8-4 l-7-4)
(connected l-7-4 l-7-5)
(connected l-7-5 l-7-4)
(connected l-7-5 l-8-5)
(connected l-8-5 l-7-5)
(connected l-7-5 l-7-6)
(connected l-7-6 l-7-5)
(connected l-7-6 l-8-6)
(connected l-8-6 l-7-6)
(connected l-7-6 l-7-7)
(connected l-7-7 l-7-6)
(connected l-7-7 l-8-7)
(connected l-8-7 l-7-7)
(connected l-7-7 l-7-8)
(connected l-7-8 l-7-7)
(connected l-7-8 l-8-8)
(connected l-8-8 l-7-8)
(connected l-7-8 l-7-9)
(connected l-7-9 l-7-8)
(connected l-7-9 l-8-9)
(connected l-8-9 l-7-9)
(connected l-8-1 l-9-1)
(connected l-9-1 l-8-1)
(connected l-8-1 l-8-2)
(connected l-8-2 l-8-1)
(connected l-8-2 l-9-2)
(connected l-9-2 l-8-2)
(connected l-8-2 l-8-3)
(connected l-8-3 l-8-2)
(connected l-8-3 l-9-3)
(connected l-9-3 l-8-3)
(connected l-8-3 l-8-4)
(connected l-8-4 l-8-3)
(connected l-8-4 l-9-4)
(connected l-9-4 l-8-4)
(connected l-8-4 l-8-5)
(connected l-8-5 l-8-4)
(connected l-8-5 l-9-5)
(connected l-9-5 l-8-5)
(connected l-8-5 l-8-6)
(connected l-8-6 l-8-5)
(connected l-8-6 l-9-6)
(connected l-9-6 l-8-6)
(connected l-8-6 l-8-7)
(connected l-8-7 l-8-6)
(connected l-8-7 l-9-7)
(connected l-9-7 l-8-7)
(connected l-8-7 l-8-8)
(connected l-8-8 l-8-7)
(connected l-8-8 l-9-8)
(connected l-9-8 l-8-8)
(connected l-8-8 l-8-9)
(connected l-8-9 l-8-8)
(connected l-8-9 l-9-9)
(connected l-9-9 l-8-9)
(connected l-9-1 l-9-2)
(connected l-9-2 l-9-1)
(connected l-9-2 l-9-3)
(connected l-9-3 l-9-2)
(connected l-9-3 l-9-4)
(connected l-9-4 l-9-3)
(connected l-9-4 l-9-5)
(connected l-9-5 l-9-4)
(connected l-9-5 l-9-6)
(connected l-9-6 l-9-5)
(connected l-9-6 l-9-7)
(connected l-9-7 l-9-6)
(connected l-9-7 l-9-8)
(connected l-9-8 l-9-7)
(connected l-9-8 l-9-9)
(connected l-9-9 l-9-8)


(accessible l-1-1)
(solid l-1-1)
(accessible l-1-2)
(medium l-1-2)
(accessible l-1-3)
(solid l-1-3)
(accessible l-1-4)
(small l-1-4)
(accessible l-1-5)
(solid l-1-5)
(accessible l-1-6)
(medium l-1-6)
(accessible l-1-7)
(solid l-1-7)
(accessible l-1-8)
(small l-1-8)
(accessible l-1-9)
(solid l-1-9)
(accessible l-2-1)
(big l-2-1)
(accessible l-2-2)
(solid l-2-2)
(accessible l-2-3)
(small l-2-3)
(accessible l-2-4)
(solid l-2-4)
(accessible l-2-5)
(medium l-2-5)
(accessible l-2-6)
(solid l-2-6)
(accessible l-2-7)
(small l-2-7)
(accessible l-2-8)
(solid l-2-8)
(accessible l-2-9)
(medium l-2-9)
(accessible l-3-1)
(solid l-3-1)
(accessible l-3-2)
(small l-3-2)
(accessible l-3-3)
(solid l-3-3)
(accessible l-3-4)
(big l-3-4)
(accessible l-3-5)
(solid l-3-5)
(accessible l-3-6)
(small l-3-6)
(accessible l-3-7)
(solid l-3-7)
(accessible l-3-8)
(big l-3-8)
(accessible l-3-9)
(solid l-3-9)
(accessible l-4-1)
(small l-4-1)
(accessible l-4-2)
(solid l-4-2)
(accessible l-4-3)
(big l-4-3)
(accessible l-4-4)
(solid l-4-4)
(accessible l-4-5)
(small l-4-5)
(accessible l-4-6)
(solid l-4-6)
(accessible l-4-7)
(big l-4-7)
(accessible l-4-8)
(solid l-4-8)
(accessible l-4-9)
(small l-4-9)
(accessible l-5-1)
(solid l-5-1)
(accessible l-5-2)
(medium l-5-2)
(accessible l-5-3)
(solid l-5-3)
(accessible l-5-4)
(small l-5-4)
(accessible l-5-5)
(solid l-5-5)
(accessible l-5-6)
(medium l-5-6)
(accessible l-5-7)
(solid l-5-7)
(accessible l-5-8)
(small l-5-8)
(accessible l-5-9)
(solid l-5-9)

(accessible l-6-1)
(big l-6-1)
(accessible l-6-2)
(solid l-6-2)
(accessible l-6-3)
(small l-6-3)
(accessible l-6-4)
(solid l-6-4)
(accessible l-6-5)
(medium l-6-5)
(accessible l-6-6)
(solid l-6-6)
(accessible l-6-7)
(small l-6-7)
(accessible l-6-8)
(solid l-6-8)
(accessible l-6-9)
(medium l-6-9)
(accessible l-7-1)
(solid l-7-1)
(accessible l-7-2)
(small l-7-2)
(accessible l-7-3)
(solid l-7-3)
(accessible l-7-4)
(big l-7-4)
(accessible l-7-5)
(solid l-7-5)
(accessible l-7-6)
(small l-7-6)
(accessible l-7-7)
(solid l-7-7)
(accessible l-7-8)
(big l-7-8)
(accessible l-7-9)
(solid l-7-9)
(accessible l-8-1)
(small l-8-1)
(accessible l-8-2)
(solid l-8-2)
(accessible l-8-3)
(big l-8-3)
(accessible l-8-4)
(solid l-8-4)
(accessible l-8-5)
(small l-8-5)
(accessible l-8-6)
(solid l-8-6)
(accessible l-8-7)
(big l-8-7)
(accessible l-8-8)
(solid l-8-8)
(accessible l-8-9)
(small l-8-9)
(accessible l-9-1)
(solid l-9-1)
(accessible l-9-2)
(medium l-9-2)
(accessible l-9-3)
(solid l-9-3)
(accessible l-9-4)
(small l-9-4)
(accessible l-9-5)
(solid l-9-5)
(accessible l-9-6)
(medium l-9-6)
(accessible l-9-7)
(solid l-9-7)
(accessible l-9-8)
(small l-9-8)
(accessible l-9-9)
(solid l-9-9)


)

(:goal (and (alive)
            (taken r1)
            (taken r2)
            (taken r3)
            (taken r4)
       )
)
)

; plan
1. (move l-1-1 l-1-2)
   deleted: (at-agent l-1-1)
   added: (at-agent l-1-2)
   goals met: 1 of 5
2. (move l-1-2 l-1-3)
   deleted: (at-agent l-1-2)
   added: (at-agent l-1-3)
   goals met: 1 of 5
3. (move l-1-3 l-1-4)
   deleted: (at-agent l-1-3)
   added: (at-agent l-1-4)
   goals met: 1 of 5
4. (move l-1-4 l-1-5)
   deleted: (at-agent l-1-4)
   added: (at-agent l-1-5)
   goals met: 1 of 5
5. (move l-1-5 l-1-6)
   deleted: (at-agent l-1-5)
   added: (at-agent l-1-6)
   goals met: 1 of 5
6. (move l-1-6 l-1-7)
   deleted: (at-agent l-1-6)
   added: (at-agent l-1-7)
   goals met: 1 of 5
7. (move l-1-7 l-1-8)
   deleted: (at-agent l-1-7)
   added: (at-agent l-1-8)
   goals met: 1 of 5
8. (move l-1-8 l-1-9)
   deleted: (at-agent l-1-8)
   added: (at-agent l-1-9)
   goals met: 1 of 5
9. (collect r1 l-1-9)
   added: (taken r1)
   goals met: 2 of 5
10. (move l-1-9 l-2-9)
   deleted: (at-agent l-1-9)
   added: (at-agent l-2-9)
   goals met: 2 of 5
11. (move l-2-9 l-2-8)
   deleted: (at-agent l-2-9)
   added: (at-agent l-2-8)
   goals met: 2 of 5
12. (move l-2-8 l-3-8)
   deleted: (at-agent l-2-8)
   added: (at-agent l-3-8)
   goals met: 2 of 5
13. (move l-3-8 l-3-7)
   deleted: (at-agent l-3-8)
   added: (at-agent l-3-7)
   goals met: 2 of 5
14. (move l-3-7 l-4-7)
   deleted: (at-agent l-3-7)
   added: (at-agent l-4-7)
   goals met: 2 of 5
15. (move l-4-7 l-4-6)
   deleted: (at-agent l-4-7)
   added: (at-agent l-4-6)
   goals met: 2 of 5
16. (move l-4-6 l-4-5)
   deleted: (at-agent l-4-6)
   added: (at-agent l-4-5)
   goals met: 2 of 5
17. (move l-4-5 l-5-5)
   deleted: (at-agent l-4-5)
   added: (at-agent l-5-5)
   goals met: 2 of 5
18. (collect r2 l-5-5)
   added: (taken r2)
   goals met: 3 of 5
19. (move l-5-5 l-6-5)
   deleted: (at-agent l-5-5)
   added: (at-agent l-6-5)
   goals met: 3 of 5
20. (move l-6-5 l-6-4)
   deleted: (at-agent l-6-5)
   added: (at-agent l-6-4)
   goals met: 3 of 5
21. (move l-6-4 l-7-4)
   deleted: (at-agent l-6-4)
   added: (at-agent l-7-4)
   goals met: 3 of 5
22. (move l-7-4 l-7-3)
   deleted: (at-agent l-7-4)
   added: (at-agent l-7-3)
   goals met: 3 of 5
23. (move l-7-3 l-7-2)
   deleted: (at-agent l-7-3)
   added: (at-agent l-7-2)
   goals met: 3 of 5
24. (move l-7-2 l-7-1)
   deleted: (at-agent l-7-2)
   added: (at-agent l-7-1)
   goals met: 3 of 5
25. (move l-7-1 l-8-1)
   deleted: (at-agent l-7-1)
   added: (at-agent l-8-1)
   goals met: 3 of 5
26. (move l-8-1 l-9-1)
   deleted: (at-agent l-8-1)
   added: (at-agent l-9-1)
   goals met: 3 of 5
27. (collect r4 l-9-1)
   added: (taken r4)
   goals met: 4 of 5
28. (move l-9-1 l-9-2)
   deleted: (at-agent l-9-1)
   added: (at-agent l-9-2)
   goals met: 4 of 5
29. (move l-9-2 l-9-3)
   deleted: (at-agent l-9-2)
   added: (at-agent l-9-3)
   goals met: 4 of 5
30. (move l-9-3 l-9-4)
   deleted: (at-agent l-9-3)
   added: (at-agent l-9-4)
   goals met: 4 of 5
31. (move l-9-4 l-9-5)
   deleted: (at-agent l-9-4)
   added: (at-agent l-9-5)
   goals met: 4 of 5
32. (move l-9-5 l-9-6)
   deleted: (at-agent l-9-5)
   added: (at-agent l-9-6)
   goals met: 4 of 5
33. (move l-9-6 l-9-7)
   deleted: (at-agent l-9-6)
   added: (at-agent l-9-7)
   goals met: 4 of 5
34. (move l-9-7 l-9-8)
   deleted: (at-agent l-9-7)
   added: (at-agent l-9-8)
   goals met: 4 of 5
35. (move l-9-8 l-9-9)
   deleted: (at-agent l-9-8)
   added: (at-agent l-9-9)
   goals met: 4 of 5
36. (collect r3 l-9-9)
   added: (taken r3)
   goals met: 5 of 5
